[Killed] StringLiteral
main/gateway/http/pokemonController.js:3:13
 const { default: axios } = require("axios")
 
-const API = "http://localhost:8081/pokemon/"
+const API = ""
 
 const pokemonController = {
killedBy: Given pokemonController When getAllPokemon is called Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8081/pokemon/all"
Received: "all"

Number of calls: 1

[Killed] ObjectLiteral
main/gateway/http/pokemonController.js:5:27
 
 const API = "http://localhost:8081/pokemon/"
 
-const pokemonController = {
-    getAllPokemon: async (_req, res) => {
-        const url = API + "all"
-        const response = await axios.get(url)
-
-        res.status(200).send(response.data)
-    },
-
-    getOnePokemon: async (_req, res, nameOrId) => {
-        const url = API + nameOrId
-        const response = await axios.get(url)
-        .catch(() => {
-            res.status(404).send("Pokemon not found")
-        })
-        res.status(200).send(response.data)
-    }
-}
+const pokemonController = {}
 
 module.exports = pokemonController
killedBy: Given pokemonController When getAllPokemon is called Then axios.get is called
statusReason: TypeError: pokemonController.getAllPokemon is not a function

[Killed] BlockStatement
main/gateway/http/pokemonController.js:6:41
 const API = "http://localhost:8081/pokemon/"
 
 const pokemonController = {
-    getAllPokemon: async (_req, res) => {
-        const url = API + "all"
-        const response = await axios.get(url)
-
-        res.status(200).send(response.data)
-    },
+    getAllPokemon: async (_req, res) => {},
 
     getOnePokemon: async (_req, res, nameOrId) => {
killedBy: Given pokemonController When getAllPokemon is called Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8081/pokemon/all"

Number of calls: 0

[Killed] BlockStatement
main/gateway/http/pokemonController.js:13:51
         res.status(200).send(response.data)
     },
 
-    getOnePokemon: async (_req, res, nameOrId) => {
-        const url = API + nameOrId
-        const response = await axios.get(url)
-        .catch(() => {
-            res.status(404).send("Pokemon not found")
-        })
-        res.status(200).send(response.data)
-    }
+    getOnePokemon: async (_req, res, nameOrId) => {}
 }
 
killedBy: Given pokemonController When getOnePokemon is called And is successful Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8081/pokemon/qualquerCoisa"

Number of calls: 0

[Killed] ArithmeticOperator
main/gateway/http/pokemonController.js:14:21
     },
 
     getOnePokemon: async (_req, res, nameOrId) => {
-        const url = API + nameOrId
+        const url = API - nameOrId
         const response = await axios.get(url)
         .catch(() => {
killedBy: Given pokemonController When getOnePokemon is called And is successful Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8081/pokemon/qualquerCoisa"
Received: NaN

Number of calls: 1

[Killed] BlockStatement
main/gateway/http/pokemonController.js:16:22
     getOnePokemon: async (_req, res, nameOrId) => {
         const url = API + nameOrId
         const response = await axios.get(url)
-        .catch(() => {
-            res.status(404).send("Pokemon not found")
-        })
+        .catch(() => {})
         res.status(200).send(response.data)
     }
killedBy: Given pokemonController When getOnePokemon is called And throws an error Then res.status is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] StringLiteral
main/gateway/http/pokemonController.js:17:34
         const url = API + nameOrId
         const response = await axios.get(url)
         .catch(() => {
-            res.status(404).send("Pokemon not found")
+            res.status(404).send("")
         })
         res.status(200).send(response.data)
killedBy: Given pokemonController When getOnePokemon is called And throws an error Then res.status().send is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Pokemon not found"
Received: ""

Number of calls: 1
