[Killed] BlockStatement
main/gateway/http/router.js:3:30
 const pokemonController = require('./pokemonController')
 
-module.exports = (router) => {
-    router.get('/api/pokemon/all', async(req, res) => {
-        await pokemonController.getAllPokemon(req, res)
-    })
-
-    router.get('/api/pokemon/:nameOrId', async(req,res) => {
-        await pokemonController.getOnePokemon(req, res, req.params['nameOrId'])
-    })
-
-    return router
-}
+module.exports = (router) => {}
killedBy: Given router is called When route /api/pokemon/all is called Then should call pokemonController.getAllPokemon
statusReason: TypeError: Cannot read property '0' of undefined

[Killed] BlockStatement
main/gateway/http/router.js:4:55
 const pokemonController = require('./pokemonController')
 
 module.exports = (router) => {
-    router.get('/api/pokemon/all', async(req, res) => {
-        await pokemonController.getAllPokemon(req, res)
-    })
+    router.get('/api/pokemon/all', async(req, res) => {})
 
     router.get('/api/pokemon/:nameOrId', async(req,res) => {
killedBy: Given router is called When route /api/pokemon/all is called Then should call pokemonController.getAllPokemon
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"params": {"nameOrId": "qualquerCoisa"}}, {}

Number of calls: 0

[Killed] BlockStatement
main/gateway/http/router.js:8:60
         await pokemonController.getAllPokemon(req, res)
     })
 
-    router.get('/api/pokemon/:nameOrId', async(req,res) => {
-        await pokemonController.getOnePokemon(req, res, req.params['nameOrId'])
-    })
+    router.get('/api/pokemon/:nameOrId', async(req,res) => {})
 
     return router
killedBy: Given router is called When route /api/pokemon/:nameOrId is called Then should call pokemonController.getOnePokemon
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"params": {"nameOrId": "qualquerCoisa"}}, {}, "qualquerCoisa"

Number of calls: 0
