[Killed] BooleanLiteral
client/src/components/Pokedex.vue:32:18
     return {
       pokemonList: {},
       rows: [],
-      showModal: false,
+      showModal: true,
       pokemonData: {},
     };
killedBy: Pokedex When component initializes Then initialize data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "pokemonData": Object {},
    "pokemonList": Object {},

[Killed] BlockStatement
client/src/components/Pokedex.vue:36:13
       pokemonData: {},
     };
   },
-  created() {
-    this.getPokemonList();
-  },
+  created() {},
   methods: {
     async getPokemonList() {
killedBy: Pokedex When component initializes Then initialize created
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
client/src/components/Pokedex.vue:40:28
     this.getPokemonList();
   },
   methods: {
-    async getPokemonList() {
-      this.pokemonList = (await pokemonApi.getPokemonList()).data;
-      this.groupColumns(this.pokemonList);
-    },
+    async getPokemonList() {},
     groupColumns(pokemonList) {
       const POKEMONS_PER_ROW = 3;
killedBy: Pokedex When getPokemonList is called Then pokemonApi.getPokemonList is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
client/src/components/Pokedex.vue:44:31
       this.pokemonList = (await pokemonApi.getPokemonList()).data;
       this.groupColumns(this.pokemonList);
     },
-    groupColumns(pokemonList) {
-      const POKEMONS_PER_ROW = 3;
-
-      for (let i = 0; i < pokemonList.length; i += POKEMONS_PER_ROW) {
-        this.rows.push(pokemonList.slice(i, i + POKEMONS_PER_ROW));
-      }
-    },
+    groupColumns(pokemonList) {},
     async initializeModal(pokemonId) {
       this.pokemonData = (await pokemonApi.getOnePokemon(pokemonId)).data;
killedBy: Pokedex When groupColumns is called Then return an divided array in rows
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

- Array [
-   Array [
-     "pokemon1",

[Killed] BlockStatement
client/src/components/Pokedex.vue:47:70
     groupColumns(pokemonList) {
       const POKEMONS_PER_ROW = 3;
 
-      for (let i = 0; i < pokemonList.length; i += POKEMONS_PER_ROW) {
-        this.rows.push(pokemonList.slice(i, i + POKEMONS_PER_ROW));
-      }
+      for (let i = 0; i < pokemonList.length; i += POKEMONS_PER_ROW) {}
     },
     async initializeModal(pokemonId) {
killedBy: Pokedex When groupColumns is called Then return an divided array in rows
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 12
+ Received  +  1

- Array [
-   Array [
-     "pokemon1",

[Killed] EqualityOperator
client/src/components/Pokedex.vue:47:23
     groupColumns(pokemonList) {
       const POKEMONS_PER_ROW = 3;
 
-      for (let i = 0; i < pokemonList.length; i += POKEMONS_PER_ROW) {
+      for (let i = 0; i <= pokemonList.length; i += POKEMONS_PER_ROW) {
         this.rows.push(pokemonList.slice(i, i + POKEMONS_PER_ROW));
       }
killedBy: Pokedex When groupColumns is called Then return an divided array in rows
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

@@ -7,6 +7,7 @@
    Array [
      "pokemon4",

[Killed] MethodExpression
client/src/components/Pokedex.vue:48:24
       const POKEMONS_PER_ROW = 3;
 
       for (let i = 0; i < pokemonList.length; i += POKEMONS_PER_ROW) {
-        this.rows.push(pokemonList.slice(i, i + POKEMONS_PER_ROW));
+        this.rows.push(pokemonList);
       }
     },
killedBy: Pokedex When groupColumns is called Then return an divided array in rows
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 6

  Array [
    Array [
      "pokemon1",

[Killed] ArithmeticOperator
client/src/components/Pokedex.vue:48:45
       const POKEMONS_PER_ROW = 3;
 
       for (let i = 0; i < pokemonList.length; i += POKEMONS_PER_ROW) {
-        this.rows.push(pokemonList.slice(i, i + POKEMONS_PER_ROW));
+        this.rows.push(pokemonList.slice(i, i - POKEMONS_PER_ROW));
       }
     },
killedBy: Pokedex When groupColumns is called Then return an divided array in rows
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

@@ -2,11 +2,7 @@
    Array [
      "pokemon1",

[Killed] BlockStatement
client/src/components/Pokedex.vue:51:38
         this.rows.push(pokemonList.slice(i, i + POKEMONS_PER_ROW));
       }
     },
-    async initializeModal(pokemonId) {
-      this.pokemonData = (await pokemonApi.getOnePokemon(pokemonId)).data;
-      this.showModal = true;
-    },
+    async initializeModal(pokemonId) {},
   },
   components: { PokemonModal },
killedBy: Pokedex When initializeModal is called Then pokemonApi.getOnePokemon is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "mockId"

Number of calls: 0

[Killed] BooleanLiteral
client/src/components/Pokedex.vue:53:24
     },
     async initializeModal(pokemonId) {
       this.pokemonData = (await pokemonApi.getOnePokemon(pokemonId)).data;
-      this.showModal = true;
+      this.showModal = false;
     },
   },
killedBy: Pokedex When initializeModal is called Then showModal is true
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: true
Received: false
