[Killed] BooleanLiteral
client/src/components/Pokemon.vue:28:18
   data() {
     return {
       pokemon: {},
-      showModal: false,
+      showModal: true,
     };
   },
killedBy: Pokemon When component initializes Then initialize data
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "pokemon": Object {},
-   "showModal": false,

[Killed] BlockStatement
client/src/components/Pokemon.vue:31:13
       showModal: false,
     };
   },
-  created() {
-    this.getPokemon();
-  },
+  created() {},
   methods: {
     async getPokemon() {
killedBy: Pokemon When component initializes Then initialize created
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
client/src/components/Pokemon.vue:35:24
     this.getPokemon();
   },
   methods: {
-    async getPokemon() {
-      this.pokemon = (
-        await pokemonApi.getOnePokemon(this.$route.query.search)
-      ).data;
-    },
+    async getPokemon() {},
   },
   components: { PokemonModal },
killedBy: Pokemon When getPokemon is called Then pokemonApi.getOnePokemon should be called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "nameOrId"

Number of calls: 0
