[Killed] ObjectLiteral
client/src/gateways/pokemon.api.js:5:20
 
 const API = "http://localhost:8082/api/pokemon/";
 
-const pokemonApi = {
-  async getPokemonList() {
-    return await axios.get(API + "all");
-  },
-  async getOnePokemon(nameOrId) {
-    return await axios.get(API + nameOrId);
-  },
-};
+const pokemonApi = {};
 
 export default pokemonApi;
killedBy: Given pokemon.api When getPokemonList is called Then axios.get is called
statusReason: TypeError: pokemonApi.getPokemonList is not a function

[Killed] BlockStatement
client/src/gateways/pokemon.api.js:6:26
 const API = "http://localhost:8082/api/pokemon/";
 
 const pokemonApi = {
-  async getPokemonList() {
-    return await axios.get(API + "all");
-  },
+  async getPokemonList() {},
   async getOnePokemon(nameOrId) {
     return await axios.get(API + nameOrId);
killedBy: Given pokemon.api When getPokemonList is called Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8082/api/pokemon/all"

Number of calls: 0

[Killed] StringLiteral
client/src/gateways/pokemon.api.js:7:34
 
 const pokemonApi = {
   async getPokemonList() {
-    return await axios.get(API + "all");
+    return await axios.get(API + "");
   },
   async getOnePokemon(nameOrId) {
killedBy: Given pokemon.api When getPokemonList is called Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8082/api/pokemon/all"
Received: "http://localhost:8082/api/pokemon/"

Number of calls: 1

[Killed] BlockStatement
client/src/gateways/pokemon.api.js:9:33
   async getPokemonList() {
     return await axios.get(API + "all");
   },
-  async getOnePokemon(nameOrId) {
-    return await axios.get(API + nameOrId);
-  },
+  async getOnePokemon(nameOrId) {},
 };
 
killedBy: Given pokemon.api When getOnePokemon is called Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8082/api/pokemon/qualquerCoisa"

Number of calls: 0

[Killed] ArithmeticOperator
client/src/gateways/pokemon.api.js:10:28
     return await axios.get(API + "all");
   },
   async getOnePokemon(nameOrId) {
-    return await axios.get(API + nameOrId);
+    return await axios.get(API - nameOrId);
   },
 };
killedBy: Given pokemon.api When getOnePokemon is called Then axios.get is called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "http://localhost:8082/api/pokemon/qualquerCoisa"
Received: NaN

Number of calls: 1
