[Killed] ObjectLiteral
client/src/views/AppView.vue:12:16
 <script>
 import SearchBar from '@/components/SearchBar.vue'
 
-export default {
-  name: 'AppView',
-  components: {
-    SearchBar
-  }
-}
+export default {}
 </script>
 
killedBy: AppView When component initializes Then validate name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "AppView"
Received: undefined
