[Killed] ObjectLiteral
client/src/views/PokedexView.vue:15:15
 
 export default {
   name: 'PokedexView',
-  components: {
-    Pokedex,
-    AppView
-  }
+  components: {}
 }
 </script>
killedBy: PokedexView When component initializes And import components Then check Pokedex
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined
