[Killed] ObjectLiteral
client/src/views/PokemonView.vue:13:16
 import Pokemon from '@/components/Pokemon.vue'
 import AppView from './AppView.vue'
 
-export default {
-  name: 'PokemonView',
-  components: {
-    Pokemon,
-    AppView
-  }
-}
+export default {}
 </script>
killedBy: PokemonView When component initializes Then validate name
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "PokemonView"
Received: undefined

[Killed] ObjectLiteral
client/src/views/PokemonView.vue:15:15
 
 export default {
   name: 'PokemonView',
-  components: {
-    Pokemon,
-    AppView
-  }
+  components: {}
 }
 </script>
killedBy: PokemonView When component initializes And import components Then check Pokedex
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined
